Repository: albanobattistella/Battery-Health-Charging
Catalog: po/*.po
Languages: it

source: Mode updated
it: Modalità di ricarica aggiornata

source: Battery Health Charging Error
it: Errore di Battery Health Charging

source: Settings
it: Impostazioni

source: Show details
it: Mostra dettagli

source: Read me
it: Leggimi

source: Unsupported device. This extension is not compatible with your device.
it: Dispositivo non supportato. Questa estensione non è compatibile con il tuo dispositivo.

source: Missing dependencies
it: Dipendenze mancanti

source: Please install polkit from extension settings under Installation.
it: Si prega di installare polkit dalle impostazioni dell'estensione in Installazione.

source: Please update polkit from extension settings under Installation.
it: Si prega di aggiornare polkit dalle impostazioni dell'estensione in Installazione.

source: Install check failed.
it: Controllo installazione non riuscito.

source: Install check timed out.
it: Il controllo dell'installazione è scaduto.

source: Encountered an unexpected error. (%s)
it: È stato incontrato un errore inatteso. (%s)

source: Charging threshold not updated. (%s)
it: Impossibile modificare la soglia di ricarica. (%s)

source: Threshold update process timed out. (%s)
it: Timeout del processo di aggiornamento della soglia. (%s)

source: Apply correct Bios Password to set threshold.
it: Applicare la password del BIOS corretta per impostare la soglia.

source: Battery 1 Charge thresholds are set to %d / %d %%
it: Batteria 1 Le soglie di ricarica sono impostate a %d / %d %%

source: Charge thresholds are set to %d / %d %%
it: Le soglie di ricarica sono impostate a %d / %d %%

source: Battery 1 Charging Limit is set to %d%%
it: Batteria 1 Limite di ricarica impostato a %d%%

source: Charging Limit is set to %d%%
it: Limite di ricarica impostato a %d%%

source: Battery 2 Charge thresholds are set to %d / %d %%
it: Batteria 2 Le soglie di ricarica sono impostate a %d / %d %%

source: Battery 2 Charging Limit is set to %d%%
it: Batteria 2 Limite di ricarica impostato a %d%%

source: Charging Mode is set to Full Capacity
it: La modalità di ricarica è impostata su Capacità massima

source: Charging Mode is set to Balanced
it: La modalità di ricarica è impostata su Bilanciata

source: Charging Mode is set to Maximum Lifespan
it: La modalità di ricarica è impostata su Ciclo di vita massimo

source: Charging Mode is set to Express
it: La modalità di ricarica è impostata su Express

source: Charging Mode is set to Adaptive
it: La modalità di ricarica è impostata su Adattiva

source: Threshold not applied: Battery level above 75%. Please unplug the charger and discharge the battery below 75% to apply the 80% limit.
it: Soglia non applicata: livello della batteria superiore al 75%. Scollegare il caricabatterie e scaricare la batteria al di sotto del 75% per applicare il limite dell'80%.

source: Battery
it: Batteria

source: Battery 1
it: Batteria 1

source: Battery 2
it: Batteria 2

source: Battery Charging Mode
it: Modalità di ricarica

source: Full Capacity Mode
it: Modalità capacità massima

source: Balanced Mode
it: Modalità bilanciata

source: Maximum Lifespan Mode
it: Modalità ciclo di vita massimo

source: Adaptive Mode
it: Modalità adattiva

source: Express Mode
it: Modalità express

source: Battery Uninstalled
it: Batteria rimossa

source: No Battery detected!
it: Nessuna batteria rilevata!

source: Charging Mode: Full Capacity
it: Modalità di ricarica: Capacità massima

source: Charging Mode: Balanced
it: Modalità di ricarica: Bilanciata

source: Charging Mode: Maximum Lifespan
it: Modalità di ricarica: Ciclo vita max.

source: Charging Mode: Adaptive
it: Modalità di ricarica: Adattiva

source: Charging Mode: Express
it: Modalità di ricarica: Express

source: Uninstalled
it: Rimossa

source: Full Capacity
it: Capacità massima

source: Balanced
it: Bilanciata

source: Max Lifespan
it: Ciclo di vita massimo

source: Adaptive
it: Adattiva

source: Force Discharge
it: Scarica forzata

source: GNU General Public License, version 3 or later
it: GNU General Public License, versione 3 o successiva

source: This application comes with absolutely no warranty. See the <a href="%s">%s</a> for details.
it: Questa applicazione non fornisce alcuna garanzia. Per maggiori informazioni consultare la <a href="%s">%s</a>.

source: Sysfs node
it: Nodo Sysfs

source: Select the type of icon for indicator and menu. In threshold settings, if <b>Customise</b> mode is selected, icon type will switch to <b>Symbols Only</b> and this option will be disabled.
it: Selezionare il tipo di icona per indicatore e menu. Nelle impostazioni della soglia, se è selezionata la modalità <b>Personalizza</b>, il tipo di icona cambierà in <b>Solo simboli</b> e questa opzione sarà disabilitata.

source: Select the type of icon for indicator and menu.
it: Selezionare il tipo di icona per indicatore e menu.

source: Remove
it: Rimuovi

source: Install
it: Installa

source: Update
it: Aggiorna

source: Installation Successful.
it: Installazione avvenuta con successo.

source: Uninstallation Successful.
it: Disinstallazione riuscita.

source: Encountered an unexpected error.
it: È stato incontrato un errore inatteso.

source: Threshold
it: Soglia

source: Full Capacity Mode (Currently Active)
it: Modalità capacità massima (attiva)

source: Balanced Mode (Currently Active)
it: Modalità bilanciata (attiva)

source: Maximum Lifespan Mode (Currently Active)
it: Modalità ciclo di vita massimo (attiva)

source: <i>Accepted Value : %d to %d</i>
it: <i>Valore accettato: da %d a %d</i>

source: About
it: Informazioni

source: Report an Issue
it: Segnala un problema

source: Translations
it: Traduzioni

source: View sources on Github
it: Visualizza sorgenti

source: Legal
it: Note legali

source: Online Tutorials
it: Tutorial online

source: Device
it: Dispositivo

source: Device settings
it: Impostazioni dispositivo

source: Change the behavior of charging indicator light
it: Modifica il comportamento della spia di carica

source: Skip Threshold Verification
it: Salta la verifica della soglia

source: Due to firmware or kernel bugs, some laptops may report incorrect thresholds consistently or after restart, sleep, or hibernate. Enable this setting to force threshold updates if you encounter this issue.
it: A causa di bug del firmware o del kernel, alcuni laptop potrebbero segnalare soglie non corrette in modo coerente o dopo il riavvio, la sospensione o l'ibernazione. Abilita questa impostazione per forzare gli aggiornamenti delle soglie se riscontri questo problema.

source: Select configuration for charging mode
it: Selezionare la configurazione per la modalità di ricarica

source: Select configuration used for changing charging mode/threshold.
it: Seleziona la configurazione utilizzata per modificare la modalità/soglia di ricarica.

source: Bios Authentication
it: Autenticazione del BIOS

source: Requires Bios password validation to change mode/threshold
it: Richiede la convalida della password del BIOS per modificare modalità/soglia

source: Enable if Dell command configure uses Bios (system) password to change mode/threshold
it: Abilita se la configurazione del comando Dell utilizza la password del BIOS (sistema) per cambiare modalità/soglia

source: Enter Bios Password
it: Inserisci la password del BIOS

source: Note: Bios password will be stored in Gnome Keyring
it: Nota: la password del BIOS verrà archiviata in Gnome Keyring

source: General
it: Generale

source: Choose icon style
it: Scegli lo stile dell'icona

source: Show notifications
it: Mostra notifiche

source: Shows notifications when the threshold is changed.
it: Mostra notifiche quando la soglia cambia.

source: Show preferences button
it: Mostra il pulsante delle preferenze

source: Adds a button to open extension preferences from quick settings panel.
it: Aggiunge un pulsante per aprire le preferenze dell'estensione dal pannello impostazioni rapide.

source: Display subtitle with current mode on quick menu button
it: Visualizza un sottotitolo con la modalità corrente sul pulsante del menu rapido

source: Displays the current mode in the text form (subtitle) on the quick menu button.
it: Visualizza il nome della modalità corrente sul pulsante del menu rapido.

source: Show system indicator
it: Mostra indicatore di sistema

source: Shows an icon in system tray.
it: Mostra l'icona nella barra delle applicazioni.

source: Indicator index
it: Posizione dell'indicatore

source: The position relative of indicator icon to other items.
it: Scambia la posizione dell'icona dell'indicatore con un'altra icona nella barra delle applicazioni.

source: Change battery indicator icon behavior
it: Cambia il comportamento dell'indicatore di batteria

source: Switches battery indicator icon to <b>charging</b> in the system tray and quick settings panel when device is plugged into power source, even when charging is disabled due to charge threshold.
it: Imposta l'icona dell'indicatore della batteria su <b>in carica</b> nella barra delle applicazioni e nel pannello delle impostazioni rapide quando il dispositivo è collegato alla fonte di alimentazione, anche quando la ricarica è disabilitata a causa della soglia di ricarica.

source: Installation
it: Installazione

source: Install privileges for this user
it: Installa i privilegi di root per questo utente

source: Install / Update / Remove
it: Installa / Aggiorna / Rimuovi

source: This device requires root privileges to change the charging limit. Setup a privileged script and give user access via polkit. <b>Root privileges are required</b> to install, update or remove the polkit policy script. <b>Install / Update </b> this polkit policy script and continue using this extension. <b>Remove</b> this polkit policy script before uninstalling this extension.
it: Questo dispositivo richiede i privilegi di root per modificare il limite di ricarica. Imposta uno script privilegiato e concedi l'accesso utente tramite polkit. <b>Sono richiesti i privilegi di root</b> per installare, aggiornare o rimuovere lo script della politica polkit. <b>Installa/Aggiorna</b> questo script di policy polkit e continua a utilizzare questa estensione. <b>Rimuovi</b> questo script di policy polkit prima di disinstallare questa estensione.

source: Symbols Only
it: Solo simboli

source: Symbol and Percentage
it: Simbolo e percentuale

source: Percentage Highlighted
it: Percentuale evidenziata

source: Enable force discharge battery feature (Experimental)
it: Abilita la funzione di scarica forzata della batteria (sperimentale)

source: Enable option to force discharge battery when battery level higher than current threshold
it: Abilita l'opzione per forzare lo scaricamento della batteria quando il livello della batteria è superiore alla soglia attuale

source: Customize
it: Personalizza

source: Default
it: Predefinito

source: Apply
it: Applica

source: Stop charging threshold value
it: Soglia per l'interruzione della ricarica

source: Current Value
it: Valore attuale

source: Start charging threshold value
it: Soglia per l'inizio della ricarica
